modified readme
